{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_4", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Normalization", "config": {"name": "convnext_small_prestem_normalization", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "invert": false, "mean": [123.675, 116.28, 103.53], "variance": [3409.9760250000004, 3262.6944000000003, 3291.890625]}, "name": "convnext_small_prestem_normalization", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Sequential", "config": {"name": "convnext_small_stem", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer_1"}}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stem_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [4, 4], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stem_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}], "build_input_shape": [null, 224, 224, 3]}, "name": "convnext_small_stem", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["convnext_small_prestem_normalization", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_0_block_0_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_0_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stem", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_0_block_0_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_0_block_0_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_0_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_0_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_0_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_0_block_0_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_0_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_0_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_0_block_0_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 96}, "name": "convnext_small_stage_0_block_0_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_0_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_0_block_0_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add"}, "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stem", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_0_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_0_block_1_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_1_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["add", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_0_block_1_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_0_block_1_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_1_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_1_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_1_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_0_block_1_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_1_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_1_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_0_block_1_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 96}, "name": "convnext_small_stage_0_block_1_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_1_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_0_block_1_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_1"}, "name": "add_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["add", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_1_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_0_block_2_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 96, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_2_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_0_block_2_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_0_block_2_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_2_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_2_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_2_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_0_block_2_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_0_block_2_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_0_block_2_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_0_block_2_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 96}, "name": "convnext_small_stage_0_block_2_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_0_block_2_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_0_block_2_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_2"}, "name": "add_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["add_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["convnext_small_stage_0_block_2_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Sequential", "config": {"name": "convnext_small_downsampling_block_0", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 56, 56, 96], "dtype": "float32", "sparse": false, "name": "input_layer_2"}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_downsampling_layernorm_0", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "convnext_small_downsampling_conv_0", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 192, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 56, 56, 96]}, "name": "convnext_small_downsampling_block_0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 96], "dtype": "float32", "keras_history": ["add_2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_1_block_0_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_0_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_downsampling_block_0", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_1_block_0_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_1_block_0_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_0_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_0_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_0_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_1_block_0_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_0_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_0_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_1_block_0_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 192}, "name": "convnext_small_stage_1_block_0_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_0_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_1_block_0_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_3"}, "name": "add_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_downsampling_block_0", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_0_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_1_block_1_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_1_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_1_block_1_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_1_block_1_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_1_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_1_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_1_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_1_block_1_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_1_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_1_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_1_block_1_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 192}, "name": "convnext_small_stage_1_block_1_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_1_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_1_block_1_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_4"}, "name": "add_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["add_3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_1_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_1_block_2_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 192, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_2_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["add_4", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_1_block_2_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_1_block_2_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_2_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_2_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_2_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_1_block_2_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_1_block_2_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_1_block_2_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 768], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_1_block_2_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 192}, "name": "convnext_small_stage_1_block_2_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_1_block_2_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_1_block_2_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_5"}, "name": "add_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["add_4", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["convnext_small_stage_1_block_2_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Sequential", "config": {"name": "convnext_small_downsampling_block_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 28, 28, 192], "dtype": "float32", "sparse": false, "name": "input_layer_3"}}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_downsampling_layernorm_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "convnext_small_downsampling_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 384, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 28, 28, 192]}, "name": "convnext_small_downsampling_block_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 192], "dtype": "float32", "keras_history": ["add_5", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_2_block_0_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 384, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_2_block_0_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_downsampling_block_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_2_block_0_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_2_block_0_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_2_block_0_pointwise_conv_1", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1536, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_2_block_0_pointwise_conv_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_layernorm", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_2_block_0_gelu", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "gelu"}, "name": "convnext_small_stage_2_block_0_gelu", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 1536], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_pointwise_conv_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "convnext_small_stage_2_block_0_pointwise_conv_2", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_2_block_0_pointwise_conv_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 1536], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_gelu", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerScale", "config": {"name": "convnext_small_stage_2_block_0_layer_scale", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "init_values": 1e-06, "projection_dim": 384}, "name": "convnext_small_stage_2_block_0_layer_scale", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_pointwise_conv_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Activation", "config": {"name": "convnext_small_stage_2_block_0_identity", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "activation": "linear"}, "name": "convnext_small_stage_2_block_0_identity", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_layer_scale", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add_6"}, "name": "add_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_downsampling_block_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_0_identity", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "convnext_small_stage_2_block_1_depthwise_conv", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 384, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "convnext_small_stage_2_block_1_depthwise_conv", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["add_6", 0, 0]}}], "kwargs": {}}]}, {"class_name": "LayerNormalization", "config": {"name": "convnext_small_stage_2_block_1_layernorm", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "convnext_small_stage_2_block_1_layernorm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 384], "dtype": "float32", "keras_history": ["convnext_small_stage_2_block_1_depthwise_conv", 0, 0]}}], "kwargs": {}}]}, 